export const words = text().split(' ');
export const streets = streetsList();
export const cities = citiesList();

function citiesList() {
	return ['אבו תלול','אבטין','אבטליון','אביאל','אביבים','אביגדור','אביחיל','אביטל','אביעזר','אבירים','אבן יהודה','אבן מנחם','אבן ספיר','אבן שמואל','אבני איתן','אבני חפץ','אבנת','אבשלום','אדורה','אדירים','אדמית','אדרת','אודים','אודם','אוהד','אום בטין','אומן','אומץ','אופקים','אור הגנוז','אור הנר','אור יהודה','אור עקיבא','אורה','אורות','אורטל','אורים','אורנים','אורנית','אושה','אזור','אחווה','אחוזם','אחוזת ברק','אחיהוד','אחיטוב','אחיסמך','אחיעזר','איבים','אייל','איילת השחר','אילון','אילות','אילניה','אילת','אירוס','איתמר','איתן','איתנים','אכסאל','אל סייד','אלומה','אלומות','אלון הגליל','אלון מורה','אלון שבות','אלוני אבא','אלוני הבשן','אלוני יצחק','אלונים','אליאב','אליכין','אליפז','אליפלט','אליקים','אלישיב','אלישמע','אלמגור','אלמוג','אלעד','אלעזר','אלפי מנשה','אלקוש','אלקנה','אמונים','אמירים','אמנון','אמציה','אניעם','אספר','אעבלין','אפיק','אפיקים','אפק','אפרת','ארבל','ארגמן','ארז','אריאל','ארסוף','אשבול','אשבל','אשדוד','אשחר','אשכולות','אשל הנשיא','אשלים','אשקלון','אשרת','אשתאול','אתגר','באר אורה','באר גנים','באר טוביה','באר יעקב','באר מילכה','באר שבע','בארות יצחק','בארותיים','בארי','בוסתן הגליל','בוקעאתא','בורגתה','בחן','בטחה','ביצרון','ביריה','בית אורן','בית אל','בית אלעזרי','בית אלפא','בית אריה','בית ברל','בית גוברין','בית גמליאל','בית דגן','בית הגדי','בית הלוי','בית הלל','בית העמק','בית הערבה','בית השיטה','בית זיד','בית זית','בית זרע','בית חורון','בית חירות','בית חלקיה','בית חנן','בית חנניה','בית חשמונאי','בית יהושע','בית יוסף','בית ינאי','בית לחם הגלילית','בית מאיר','בית נחמיה','בית ניר','בית נקופה','בית עובד','בית עוזיאל','בית עזרא','בית עריף','בית צבי','בית קמה','בית קשת','בית רבן','בית רימון','בית שאן','בית שמש','בית שערים','בית שקמה','ביתן אהרן','ביתר עילית','בלפוריה','בן זכאי','בן עמי','בני ברק','בני דקלים','בני דרום','בני דרור','בני יהודה','בני נצרים','בני עטרות','בני ציון','בני ראם','בניה','בסמת טבעון','בענה','בצרה','בצת','בקוע','בקעות','בר גיורא','בר יוחאי','ברוכין','ברור חיל','ברוש','ברכה','ברכיה','ברעם','ברק','ברקאי','ברקן','ברקת','בת הדר','בת חן','בת חפר','בת חצור','בת ים','בת עין','בת שלמה','גאולי תימן','גאולים','גאליה','גבולות','גבים','גבע','גבע בנימין','גבע כרמל','גבעולים','גבעון החדשה','גבעות בר','גבעת אבני','גבעת אלה','גבעת ברנר','גבעת השלושה','גבעת זאב','גבעת יואב','גבעת יערים','גבעת ישעיהו','גבעת עוז','גבעת שמואל','גבעת שמש','גבעת שפירא','גבעתי','גבעתיים','גברעם','גבת','גדות','גדיש','גדעונה','גדרה','גונן','גורן','גורנות הגליל','גזית','גזר','גיאה','גיבתון','גיזו','גילון','גילת','גינוסר','גיניגר','גינתון','גיתה','גיתית','גלאון','גלגל','גליל ים','גמזו','גן הדרום','גן השומרון','גן חיים','גן יאשיה','גן יבנה','גן נר','גן שורק','גן שלמה','גן שמואל','גנות','גנות הדר','גני הדר','גני טל','גני יוחנן','גני מודיעין','גני עם','גני תקווה','געש','געתון','גפן','גרופית','גשור','גשר','גשר הזיו','גת רימון','דבורה','דבוריה','דבירה','דברת','דולב','דור','דורות','דחי','דייר חנא','דייר ראפאת','דימונה','דישון','דליה','דלתון','דמיידה','דן','דפנה','דקל','האון','הבונים','הגושרים','הדר עם','הוד השרון','הודיה','הודיות','הושעיה','הזורע','הזורעים','החותרים','היוגב','הילה','המעפיל','הסוללים','העוגן','הר אדר','הר גילה','הר עמשא','הראל','הרדוף','הרצליה','הררית','ורד יריחו','ורדון','זבדיאל','זוהר','זיקים','זיתן','זכרון יעקב','זכריה','זמר','זמרת','זנוח','זרועה','זרזיר','זרחיה','חבצלת השרון','חבר','חברון','חגור','חגי','חגלה','חדיד','חדרה','חולדה','חולון','חולית','חולתה','חוסן','חוסנייה','חופית','חוקוק','חורה','חורפיש','חורשים','חזון','חיבת ציון','חיננית','חיפה','חירות','חלוץ','חלמיש','חלץ','חמאם','חמד','חמדיה','חמדת','חמרה','חניאל','חניתה','חנתון','חספין','חפץ חיים','חצב','חצבה','חצור הגלילית','חצר בארותיים','חצרות חולדה','חצרות יסף','חצרים','חרב לאת','חרוצים','חריש','חרמש','חרשים','חשמונאים','טבריה','טורעאן','טייבה','טירה','טירת יהודה','טירת כרמל','טירת צבי','טל שחר','טללים','טלמון','טמרה','טנא','טפחות','יבול','יבנאל','יבנה','יגור','יגל','יד בנימין','יד השמונה','יד חנה','יד מרדכי','יד נתן','ידידה','יהל','יובל','יובלים','יודפת','יונתן','יושיביה','יזרעאל','יחיעם','יטבתה','יכיני','ינוב','ינון','יסוד המעלה','יסודות','יסעור','יעד','יעל','יעף','יערה','יפיע','יפית','יפעת','יפתח','יצהר','יציץ','יקום','יקיר','יקנעם עילית','יראון','ירדנה','ירוחם','ירושלים','ירחיב','ירכא','ירקונה','ישע','ישעי','ישרש','יתד','יתיר','כאבול','כברי','כדורי','כדיתה','כוכב השחר','כוכב יאיר','כוכב יעקב','כוכב מיכאל','כורזים','כחל','כחלה','כיסופים','כישור','כליל','כלנית','כמאנה','כמהין','כמון','כנות','כנף','כסיפה','כסלון','כפר אביב','כפר אדומים','כפר אוריה','כפר אחים','כפר ביאליק','כפר בלום','כפר בן נון','כפר ברא','כפר ברוך','כפר גדעון','כפר גלים','כפר גליקסון','כפר גלעדי','כפר דניאל','כפר האורנים','כפר החורש','כפר המכבי','כפר הנגיד','כפר הנוער הדתי','כפר הנשיא','כפר הס','כפר ויתקין'];
}
function streetsList() {
	return ['אבן גבירול','אבן עזרא','אהרונסון אהרון','אוסישקין','אחאב','איריס','אלון יגאל','אמיל זולה','אמיר','אנגל','אסתר','אצל','ארלוזורוב','ארנון','אשכול לוי','בגין מנחם','בוקצין','ביאליק','בילינסון','בלפור','בן יהודה','בר יהודה','בר לב חיים','ברכה','ברנר','ברש','גולומב','גולני','גורדון','גני אילן','דב הוז','דבורה הנביאה','דוד דבורה','דוד המלך','דרך איתן','דרך בר אילן','דרך דורי יעקב','דרך הגנים','האגוז','האגס','האלון','האפרסק','הארז','האתרוג','הבטחון','הברוש','הגדוד העברי','הגפן','הדובדבן','הדסה','הדרור','ההגנה','ההדר','הולצברג שמחה','הורד','הושע','הזית','הזמיר','החבצלת','החשמל','הירקון','הכלנית','הכפר','הלימון','המגינים','המהריץ','המייסדים','המעגל','המעפילים','הנביאים','הנשיא','הס','העמל','הפלמח','הפרדס','הצבעוני','הצבר','הקישון','הקשת',' גלבוע',' הכרמל',' חרמון',' תבור','הרב ימיני חיים','הרב שלום יצחק','הרוגי מלכות בבל','הרימון','הרצוג חיים','הרצל','הרצפלד','השזיף','השלושה','השקד','השקמה','התאנה','התזמורת','התמר','התפוז','התפוח','וולך','וילסון','וינגיט','ושינגטון','זבוטינסקי','זיידמן','חזקיהו','חטיבת אלכסנדרוני','טרומן','טרומפלדור','טשרניחובסקי','יהואש','יהודה הלוי','יהודה המכבי','יהודית','יחזקאל','יעל','יפה נוף','ירושלים','ירמוך','ירמיהו','ישעיהו','ככר האחים גרין','כצנלסון','לודרדייל לייקס','לוחמי האש','לוין','לוס אנגלס','לחי','לינקולן','לכיש','לנדאו','מגידו','מודיעין','מונטיפיורי','מורדי הגטאות','מלצט','מעלות נעורים','מצדה','משה אהרון טוב','נהר הירדן','נורדאו','נחל גמלא','נחל דליות','נחל','נחל חרמון','נחל משושים','נחל סער','נחל שיאון','נחל שניר','נחלת נשלסק','סוקולוב',' בזל',' דרייפוס',' האשל',' העץ הבודד',' חובבי ציון','סנה משה','סנש','סעדיה גאון','עגנון','עזר ומרזוק','עמוס','עמק איילון','עמק האלה','עמק הורדים','עמק הירדן','עמק יזרעאל','פנקס','פסגת אונו','פקיעין','פרדס רייספלד','צדקיהו','צהל','קורצק','קפלן','קרית אונו','רבין יצחק','רוטשילד','רופין','רחבת בני ברית','רחבת דראכטן','רחבת האורן','רייק חביבה','רמבן','רמה','רמז','רקפת','רשי',' אנגלו סקסי',' חברת חשמל',' ירון',' עובדים',' קיראון',' רימון',' רסקו','שאול המלך','שבזי','שד בן גוריון','שד סולד הנריטה','שד קציר אהרון','שד קרן קימת','שדה יצחק','שוחט מניה','שטרן יאיר',' גרין',' עבר הירדן',' שער הקריה','שלמה המלך','שמואל הנביא','תל חי','תנועת המרי','אזור התעשייה','ארץ חמדה','אשמורת יצחק','בן יפונה','בתי אפרים','גבעת האבות','גור אריה','דוד המלך','הרב צבי יהודה','טבנקין','יאיר','יהושע  נון','יוני נתניהו','ישיבה תיכונית','מכללת יהודה','מלון אשכולות','מעלות חברון','נופי ממרא','נחל אשכול','סולם אלדד','עמק חברון','קרית ארבע','ראם','רמת ממרא',' החלוצים',' הקרוונים','אבן גבירול','אבן עזרא','אגמית','אורנים','אזור התעשיה','אחד העם','אינשטין','אלבז','אליהו הנביא','אלמוגן','אלשייך','אנילביץ','אנפה','ארלוזורוב','אשכנזי','אתא','בונר','ביס ארצי לשוטרים','ביאליק','בילו','בית לחם','ביתר','בכורים','בן יהודה','בן יוסף אהרון','בן יוסף שלמה','בן עמי','בן צבי יצחק','בן ציון','בעל  טוב','בצרי יוסף','בר אילן','בר יהודה','בר יוחאי','בר כוכבא','ברבור','ברדיצבסקי','ברנדייס','ברנר','בתי מפעל','גקומטי אלברטו','גבורי הקריה','גבעה','גבעת הרקפות','גבעת','גבעת','גוגן','גויה','גולומב','גוש עציון','גלבוע','דאלי','דגה','דוכיפת','דפנה','דקר','דרך אושה','דרך דשנים','דרך חיפה','דרך יגור','דרך יצחק רבין','דרך כפר חסידים','דרך מנחם בגין','דרך שפרעם','האורן','האלה','האלון','האסיף','הארז','הארי השואג','האשל','הברוש','הגבורה','הגורן','הגליל','הגפן','הדס','הדקלים','ההגנה','הושע','הותיקים','הזית','החרוב','היערה','הירדן','הירקון','הכלנית','הלל','המג','המגינים','המחרשה','המיסדים','המכבים','המלאכה','המעפילים','הנביאים','הנגב','הנרי מור','הנרקיסים','העמק','העצמאות','הערמונים','הצנחנים','הקורנית','הקישון','הרב דוידאשווילי','הרב עוזיאל','הרב קוק','הרדוף','הרי גולן','הרצוג','הרצל','הרר צבי','השבעה','השומר','השופטים','השוק','השיטה','השקדים','השקמה','התאנים','התבור','התמרים','התנאים','התעלה','התעשיה','ואן גוך','וולסקיז','וינגייט','ויצמן','ורד','זבוטינסקי','זבולון','זכריה','זמיר','זמנהוף','חבצלת','חבקוק','חברון','חגי','חוחית','חופית','חנקין','חפץ חיים','טביב אברהם','טרומפלדור','טשרניחובסקי',' באדר','יבניאלי שמואל','יהודה הלוי','יהודה הנשיא','יהושע  נון','יואב','יואל','יונה','יוספטל','ילג','יסמין','יצחק שדה','ירושלים','ירמיהו','ישעיהו','כביש ראשי','כהן אלי','כהן יעקב','ככר בני ברית','ככר העיריה','ככר הפרחים','כנרת','לוטרק','לוי יפה','לזה','לילינבלום','מאיה','מאנה','מאפו','מבצע סיני','מגלן','מגריט','מודיליאני','מולר הוגו','מונדריאן','מוצקין','מורדי הגטאות','מורן','מטיס','מיכה','מימון','מינץ','מירו','מירון','מלאכי','מנדלי מוכר ספרים','מנלה','  נחום','מעלה החרמון','מקור ברוך','מרזוק','מרכז העיר','מרכז חדש','משאש יוסף','נווה אברהם','נוף הכרמל','נורדאו','נחום','נחל נעמן','נחל קדרון'];
}
function text() {
	return 'מעין הפלא ' +
		'קוריאה ' +
		'לפני שנים רבות חיו בכפר זקן ' +
		'וזקנה  הזקנה דאגה לבית והזקן ' +
		'נהג ללכת ליער  להביא עצי הסקה  ' +
		'הכל היה טוב  רק ילדים לא היו ' +
		'להם  וזה צער אותם מאוד  ' +
		'הלך פעם הזקן להביא עצים  הביט ' +
		'על אשתו ושאל ' +
		' מדוע את  זקנה שלי  כל כך ' +
		'מודאגת   ' +
		'והיא אומרת לו  איך לא אדאג  ' +
		'בעלי  אין לנו ילדים  נמות ולא יהיה ' +
		'מי שיקבור אותנו   ' +
		'נאנח הזקן בכבדות ובלי לומר מילה ' +
		'יצא מהבית  ' +
		'הוא בא ליער  פתאום שומע איך ' +
		'ציפור שרה  והקול שלה כמו פעמון ' +
		'של בדולח  הוא הביט לכל כוון וראה ' +
		'את הציפור  בטן שלה כמו דשא ' +
		'טרי  גרון כמו כחול השמיים  קשה ' +
		'שלא להביט ולהתפלא  ' +
		'הציפור שמה את ראשה הצדה  ' +
		'הביטה על הזקן בעיניה כמו חרוזים ' +
		'ועברה לעץ שני  התיישבה על הענף ' +
		'ומביטה על הזקן כאילו מזמינה אותו ' +
		'אליה  ' +
		'הזקן ניגש קרוב יותר  והציפור ' +
		'התרוממה מהענף ועפה הלאה  וכל ' +
		'הזמן שרה  מזמרת  ' +
		'הזקן הלך אחריה לתוך הסבך  ' +
		'הגדול  והציפור עפה משם  ולא ' +
		'ראה אותה יותר  ' +
		'הזקן הקשיב   אולי היא שרה עוד ' +
		'איפה שהוא  אך לא  שקט סביב ורק ' +
		'לא רחוק פלג מים זורם  הזקן ' +
		'הסתכל היטב וראה שמתחת לאבן ' +
		'מעין בוקע  והמים בו כמו דמעה  ' +
		'שקופים  נקיים  ' +
		'הוא ניגש למעין ורצה לשתות את ' +
		'המים  לקח לגימה אחת והרגיש כוח ' +
		'גדל בגופו  רגליו הזקנות הפסיקו ' +
		'לרעוד  בוורידים התחיל לזרום דם ' +
		'חם  ' +
		' איזה פלא   חשב הזקן  הוא הרים ' +
		'יד כדי למשוך בזקן שלו   אולי הוא ' +
		'רק חלום חולם   אבל זקן איננו  ' +
		'כאילו לא היה מעולם  ' +
		'שמח הזקן  כנראה מצא את מעין ' +
		'הנעורים שעליו סיפרו אגדות בכפר   ' +
		'הוא לקח עוד לגימה והחריצים ' +
		'העמוקים שעל פניו נעלמו והוא הפך ' +
		'לאיש צעיר  ' +
		'הוא רץ מהר הביתה  רץ וכל הזמן ' +
		'משתדל לזכור את הדרך  כדי ' +
		'להביא את הזקנה שלו אל המעיין  ' +
		'והזקנה חיכתה  חיכתה לשובו ' +
		'ויצאה מולו  אולי הוא נחלש בדרך  ' +
		'צריך לעזור לו  חושבת  ' +
		'היא הולכת בדרך ומולה רץ בחור ' +
		'צעיר  היא נעצרה ושואלת  אולי ' +
		'ראית איש זקן עם עצי הסקה  הוא ' +
		'הלך בבוקר ועדיין לא חזר   ' +
		'והצעיר רק צוחק  תסתכלי עלי ' +
		'היטב  זקנה  האם אינך מכירה את ' +
		'בעלך קים   ' +
		'הזקנה נבהלה  הקול מוכר לה ' +
		'היטב  וקים סיפר לה כל מה שקרה ' +
		'לו  והוביל אותה אל מעיין הפלא  ' +
		'הזקנה לקחה שתי לגימות והפכה ' +
		'לאישה צעירה יפהפה  הצעיר לקח ' +
		'את ידה של הצעירה והם חזרו ' +
		'שמחים הביתה  ' +
		'הגיעו ביתה ושם ליד הדלת עומד ' +
		'שכן  ' +
		' ערב טוב  שכן  אומר קים  ' +
		'והשכן לא מכיר אותו  ' +
		'סיפר לו קים כל מה שקרה לו ולשכן ' +
		'הבריקו עיניים  אמור מהר  איפה ' +
		'המעיין בוקע   ' +
		'קים הסביר לו איך להגיע למעין ' +
		'והשכן רץ מהר הביתה  לבש בגד ' +
		'חדש  חבש כובע גדול ורץ להרים  ' +
		'הוא הגיע למקום שעליו סיפר קים ' +
		'וראה   אמנם מים זורמים ממעין  ' +
		'ירד השכן על ברכיים  שתה לגימה ' +
		'אחת  שתה שניה  והפך לאיש ' +
		'צעיר  ' +
		'ואז חשב  אני רוצה להיות צעיר ' +
		'יותר מאשר קים   הוא לקח עוד ' +
		'לגימה ונעשה לילד  ניגב את שפתיו ' +
		'והוסיף  המים טעימים מאוד  ' +
		'אשתה עוד לגימה   כך חשב ' +
		'והמשיך לשתות מים   ' +
		'בערב הלך קים אל השכן ולא מצא ' +
		'אותו בבית  קים נבהל  אולי קרה לו ' +
		'דבר מה  והלך אל המעיין  ' +
		'הגיע ורואה   על הארץ מונח בגד ' +
		'חדש וכובע גדול  והשכן איננו  קים ' +
		'ניגש קרוב יותר  הרים את הכובע   ' +
		'איזה פלא  תחת הכובע שוכב ' +
		'תינוק וישן חזק  ' +
		'נענע קים בראשו ' +
		' כמה שאתה טיפש  שכני  האם ' +
		'אפשר לשתות כל כך הרבה מי ' +
		'פלא   ' +
		'הוא עטף את הילד בבגד שהיה ' +
		'זרוק על האדמה והביא הביתה  ' +
		'שמחה האישה כשראתה את הילד  ' +
		'היא כבר מזמן השתוקקה לבן  ' +
		'וכך הם המשיכו לחיות בשלושה  ' +
		'והילד גדל והיה לאדם טוב וחרוץ  ' +
		'איוון בן האיכר ' +
		'במדינה אחת  בכפר אחד  חיו הורים זקנים  איכרים ' +
		'שעבדו את אדמתם  היו להם שלושה בנים  אינני יודע ' +
		'את שמות שני הגדולים  אך לצעיר קראו איוון  ' +
		'פעם התפרסם במדינה שמעבר לנהל סמורודינה ' +
		'התנחל פלא מפלץ איום  שמתנפל על בני אדם והורג ' +
		'אותם  ' +
		'ההורים הזקנים דאגו מאוד כששמעו זאת  והבנים ' +
		' נלך להלחם עם פלא מפלץ האיום הזה  נכניע ' +
		'החליטו – ' +
		'אותו או נמות עצמנו  ' +
		'בעצב רב נפרדו ההורים מבניהם  והבנים לקחו את ' +
		'החרבות הדמשקאיות שלהם  תרמילים עם לחם ומלח  ' +
		'עלו על סוסיהם הטובים ונסעו  ' +
		'הם רכבו ורכבו עד שהגיעו לכפר כלשהו  מביטים   ' +
		'סביב אין נפש חיה ורק בית קטן אחד עומד שלם  נכנסו ' +
		'האחים לבית הזה  ושם אישה זקנה יושבת על תנור ' +
		'ושואלת: ' +
		' צעירים טובים  לאן דרככם   ' +
		' אנו  סבתא  נוסעים לנהר סמורודינה  שעובר עליו גשר ' +
		'עץ אשור חזק  שם אנו רוצים להתמודד עם פלא מפלץ ' +
		'האיום  למנוע ממנו להגיע אל האדמות שלנו   ' +
		' אכן מעשה טוב לקחתם על עצמכם  צעירים   ' +
		'האישה הזקנה הלינה את האחים ובבוקר נתנה להם ' +
		'ברכת דרך  ' +
		'רכבו שוב האחים עד שהגיעו לגשר עץ האשור שעל ' +
		'נהר סמורודינה  על חוף הנהר ראו פזורות שם חרבות ' +
		'וקשתות שבורות  וגם עצמות בני אדם  ' +
		'לא רחוק עמד בית קטן  ריק  והם החליטו ללון בו  ' +
		' הנה  אחים  אמר איוון  הגענו למטרה שלנו  אבל ' +
		'אנחנו במקום זר וצריך להקשיב היטב ולצפות היטב ' +
		'סביב  הבה ונעשה זאת במשמרות ונשמור שאף אחד ' +
		'לא יעבור את גשר עץ האשור שעל הנהר   ' +
		'בלילה הראשון שמר האח הבכור  הוא עבר לאורך ' +
		'החוף  הביט על נהר סמורודינה  ראה שהכל שקט  לא ' +
		'רואים נפש  הוא נשכב תחת שיח ונרדם  ' +
		'ואיוון בינתיים לא יכול היה לישון  לקראת חצות הוא קם  ' +
		'לקח את חרבו הדמשקאית ויצא לחוף הנהר  רואה   ' +
		'אחיו ישן תחת השיח   ' +
		'איוון לא העיר אותו אלא ירד בעצמו תחת לגשר עץ ' +
		'האשור  ' +
		'עבר זמן ופתאום המים בנהר סערו  עיט שעל עץ גבוה ' +
		'זעק  הופיע פלא מפלץ איום בעל ששה ראשים  הוא ' +
		'עלה על גשר עץ האשור רוכב על סוס אש  העורב יושב ' +
		'על כתפו  ומאחוריו רועש יער שחור  ' +
		'ופלא מפלץ האיום אומר  שמעתי שאיוון בן האיכר בא ' +
		'להתמודד אתי  איפה הוא  אשים אותו על כף ידי אחת  ' +
		'אמחץ בשניה ונגמור את העניין   ' +
		'ואז יצא איוון מתחת הגש ואומר: ' +
		' אל לך להתרברב הזד  הבה ונשווה את כוחותינו   ' +
		'והם התחילו בהתמודדות עד שהאדמה רעדה ' +
		'תחתיהם  במכה אחת של החרב הוריד איוון בן האיכר ' +
		'לפלא מפלץ שלושה ראשים  ' +
		'צועק פלא מפלץ: ' +
		' תן לנוח   ' +
		'ואיוון בן האיכר עונה: ' +
		' לך עוד שלושה ראשים ולי רק אחד  כשיישאר אצלך ' +
		'רק ראש אחד אתן לך לנוח    ' +
		'שוב התחילו להלחם ושוב בתנופת חרב אחד הוריד ' +
		'איוון בן האיכר שלושת הראשים נותרים של פלא מפלץ  ' +
		'ואז הוא חתך את גופתו של המפלצת לחתיכות קטנות ' +
		'וזרק אותן לנהר  ואת ששת הראשים שם תחת גשר עץ ' +
		'האשור  ' +
		'חזר איוון לבית הקטן ונשכב לישון  ' +
		'בבוקר חזר האח הבכור מהשמירה  ' +
		' ראית משהו בלילה   שואל אותו איוון  ' +
		' אפילו זבוב לא עבר לידי  אפילו יתוש לא זמזם   ' +
		'למחרת הגיע תורו של האח השני לשמור  הוא יצא ' +
		'לחוף הנהר  הביט סביב ואחר כך נשכב בין שיחים ' +
		'ונרדם שם  ' +
		'איוון לא סמך עליו  לקראת חצות הלילה לקח את חרבו ' +
		'החדה ויצא אל הנהר סמורודינה  שם ירד תחת גשר עץ ' +
		'האשור והתחיל לשמור  ' +
		'ושוב סערו מי הנהר ויצא מהמים ופלא מפלץ איום בן ' +
		'תשעה ראשים  איוון בן האיכר בא מולו כדי להתמודד ' +
		'בו   ' +
		'הניף איוון את חרבו הדמשקאית והוריד ששה ראשים ' +
		'של פלא מפלץ  ופלא מפלץ הכה לאיוון מלמעלה עד ' +
		'שהוא שקע באדמה עד הברכיים  ' +
		'לקח איוון חופן חול וזרק בעיני האויב  עד שפלא מפלץ ' +
		'ניגב את החול מעיניו איוון בן האיכר הוריד לו את ' +
		'שלושת הראשים הנותרים  ' +
		'שוב הוא חתך את גופתו של המפלץ לחתיכות  ותשעה ' +
		'הראשים שם תחת גשר עץ האשור  ואז חזר לבית ' +
		'הקטן  נשכב ונרדם  ' +
		' בבוקר בא האח שיצא לשמור ' +
		' ראית משהו בלילה   שואל אותו איוון  ' +
		' אפילו זבוב לא עבר לידי  אפילו יתוש לא זמזם   ' +
		' אז בואו אחיי אתי  אראה לכם זבוב ויתוש   ' +
		'הוביל אותם איוון תחת גשר עץ האשור והראה להם את ' +
		'ראשי פלא מפלץ  האחים התביישו מאוד  ' +
		'בלילה שלישי היה תורו של איוון לשמור  ' +
		'הוא אמר לאחים: ' +
		' אני יוצא עכשיו לקרב איום  ואתם  כשרק תשמעו את ' +
		'קריאתי  שחררו את הסוס שלי ובואו לעזרה    ' +
		'יצא איוון בן האיכר אל נהר סמורודינה  ובחצות הלילה ' +
		'יצא על גשר עץ האשור פלא מפלץ בעל שתים עשר ' +
		'ראשים רוכב על סוסו  כל שתים עשר הראשים שורקים ' +
		'קול מחריש אוזניים ויורקים אש  לסוסו של פלא מפלץ ' +
		'שתים עשרה כנפיים  פרוותו מנחושת  זנב ורעמה ' +
		'מברזל  ' +
		'איוון בן האיכר יצא מולו מתחת לגשר עץ  ' +
		' מה איתך איוון  לשם מה באת   שאל פלא מפלץ  ' +
		' אלחם בך  יצור מקולל  כדי שלא תמשיך להרוג אנשים ' +
		'טובים   עונה לו איוון בן האיכר  ' +
		'הוא הניף את חרבו החדה והוריד למפלץ שלושה ' +
		'ראשים  אבל פלא מפלץ תפס אותם  נגע בהם באצבע ' +
		'לוהטת שלו  הניח על הצוואר והם נדבקו בחזרה  ' +
		'רע היה לאיוון  פלא מפלץ מחריש אותו בשריקה  יורק ' +
		'עליו אש  מכה בו עד שאיוון שוקע עד הברכיים באדמה  ' +
		'איוון בן האיכר אגר כוחות ושוב הוריד למפלץ ששה ' +
		'ראשים  פלא מפלץ תפס את הראשים  נגע בהם ' +
		'באצבע לוהטת שלו  שם לצוואר והם שוב נדבקו   ' +
		'ועכשיו נתן לו פלא מפלץ מכה כזו שאיוון שקע באדמה ' +
		'עד החגורה  אבל הוא הניף את החרב בשלישית והוריד ' +
		'לפלא מפלץ תשעה ראשים  פלא מפלץ תפס אותם  נגע ' +
		'בהם באצבע לוהטת  שם על הצוואר והם שוב נדבקו  ' +
		'ןאז התנפל על איוון ובמכה השקיע אותו באדמה עד ' +
		'הכתפיים  ' +
		'איוון הוריד את כובעו וזרק אותו אל הבית  רק אז ' +
		'התעוררו האחים  פתחו אורווה  שחררו את הסוס של ' +
		'איוון ובעצמם רכבו אחרי הסוס לאיוון לעזרה  ' +
		'הסוס של איוון התחיל לבעוט בפלא מפלץ בפרסות ' +
		'שלו  ואיוון יצא מהאדמה  כוון היטב וחתך לפלא מפלץ ' +
		'את האצבע הלוהטת ומיד המשיך לחתוך את הראשים  ' +
		'הוריד את כולם  את הגוף חתך לחתיכות קטנות  פירר ' +
		'אותם וזרק פירורים לתוך הנהר סמורודינה  ' +
		'ינתיים הגיעו האחים  לקחו את איוון לבית  רחצו אותו  ' +
		'ב ' +
		'האכילו  השקו והשכיבו לישון  ' +
		'בבוקר מוקדם קם איוון ויצא אל הבית האבן של ' +
		'פלא מפלץ  ישבו שם שלוש פלא מפלצות  נשים של ' +
		'המפלץ וגם האם  מפלצת דרקון זקנה   ' +
		'הן דיברו ביניהן איך לנקום את מותו של פלא מפלץ  ' +
		'הקשיב להם בהסתר איוון בן האיכר וחזר אל אחיו  ' +
		'התחילו האחים לחזור הביתה  נסעו בשדות  בעמקים  ' +
		'יום היה חם ומעייף  רצו מאוד לשתות  והנה במקום ' +
		'אחד ראו באר  אמרו לאיוון: ' +
		' נעצור כאן ונשתה מים קרים  ננוח   ' +
		'איוון קפץ מהסוס ובחרב הכה בדפנות הבאר  התחילה ' +
		'הבאר לילל  לשאוג  התפורר ולא היה יותר  ומיד בא ' +
		'ענן  החום פסק וכבר לא רצו יותר לשתות  ' +
		'נסעו האחים הלאה  נסעו זמן רב וראו עץ תפוח  ירדו ' +
		'האחים מהסוסים כדי לקטוף תפוחים  אבל איוון התחיל ' +
		'לחתוך את העץ סמוך לשורשים  התחיל העץ לילל  ' +
		'לשאוג   נפל על נארץ ומת  ' +
		'עלו האחים שוב על הסוסים והמשיכו בדרך  ' +
		'רכבו זמן רב והתעייפו מאוד  והנה רואים על העשב ' +
		'מונח שטיח רקום  רצו האחים לשכב על השטיח כדי ' +
		'לנוח  ואיוון לא אמר להם מילה אלא הוריד את ' +
		'האבנט שלו וזרק על השטיח  האבנט נדלק  בער ' +
		'בלהבה גדולה ונשרף  לא נשאר ממנו דבר   ' +
		'אזי ניגש איוון אל השטיח  חתך אותו לחתיכות ואמר ' +
		'לאחים: ' +
		' הבאר  עץ התפוח  השטיח  אלה היו נשים של ' +
		'פלא מפלץ  הן רצו להרוג אותנו אבל לא הצליחו ונהרגו ' +
		'בעצמן   ' +
		'נסעו האחים הלאה  ' +
		'פתאום השמיים חשכו  רוח יללה  אדמה רעדה  עפה ' +
		'מפלצת דרקון  אם של פלא מפלץ בעצמה  פתחה את ' +
		'הלוע שלה מהשמיים ועד הארץ  רוצה לבלוע את איוון ' +
		'יחד עם אחיו  ' +
		'ראה איוון שזו צרה גדולה  הכה בסוסו והתחיל לדהור  ' +
		'והאחים אחריו  דוהרים ורואים   לפניהם נפחיה ונפחים ' +
		'עובדים בה  ' +
		'הנפחים הכניסו את איוון והאחים וסגרו אחריהם תריסר ' +
		'דלתות ברזל ונעלו בתריסר מנעולים מחושלים  ' +
		'באה מפלצת דרקון לנפחיה וצועקת: ' +
		' נפחים  תנו לי את איוון ואת אחיו    ' +
		'והנפחים אומרים: ' +
		' תלקקי בלשון הלוהטת שלך תריסר דלתות ברזל ' +
		'ותריסר מנעולים מחושלים ואז תקחי אותם   ' +
		'התחילה מפלצת דרקון ללקק את דלתות הברזל  ' +
		'ליקקה  ליקקה  ליקקה אחת עשרה דלתות  נשארה ' +
		'הדלת האחרונה  ' +
		'התעייפה מפלצת דרקון ולפני הדלת האחרונה ישבה ' +
		'לנוח  ואז איוון בן האיכר קפץ מהנפחיה  תפס את ' +
		'המפלצת ובתנופה דפק בה באבן  התפוררה המפלצת ' +
		'הזקנה לחתיכות קטנות והרוח פיזרה אותן לכל ' +
		'הכיוונים  ' +
		'מאז נעלמו כל המפלצות בארץ זו והאנשים יכלו לחיות ' +
		'בבטחון ובשלום  ' +
		'ואיוון בן האיכר חזר הביתה יחד עם האחים  לאבא ' +
		'ולאמא  והם המשיכו לחיות כמו קודם  כמו קודם חרשו ' +
		'שדות  זרעו שיפון וחיטה  ';
}
