export const words = text().split(' ');

function text() {
	return 'מעין הפלא ' +
		'קוריאה ' +
		'לפני שנים רבות חיו בכפר זקן ' +
		'וזקנה. הזקנה דאגה לבית והזקן ' +
		'נהג ללכת ליער, להביא עצי הסקה. ' +
		'הכל היה טוב, רק ילדים לא היו ' +
		'להם, וזה צער אותם מאוד. ' +
		'הלך פעם הזקן להביא עצים, הביט ' +
		'על אשתו ושאל ' +
		'"מדוע את, זקנה שלי, כל כך ' +
		'מודאגת?" ' +
		'והיא אומרת לו "איך לא אדאג, ' +
		'בעלי. אין לנו ילדים. נמות ולא יהיה ' +
		'מי שיקבור אותנו." ' +
		'נאנח הזקן בכבדות ובלי לומר מילה ' +
		'יצא מהבית. ' +
		'הוא בא ליער. פתאום שומע איך ' +
		'ציפור שרה, והקול שלה כמו פעמון ' +
		'של בדולח. הוא הביט לכל כוון וראה ' +
		'את הציפור. בטן שלה כמו דשא ' +
		'טרי, גרון כמו כחול השמיים, קשה ' +
		'שלא להביט ולהתפלא. ' +
		'הציפור שמה את ראשה הצדה, ' +
		'הביטה על הזקן בעיניה כמו חרוזים ' +
		'ועברה לעץ שני. התיישבה על הענף ' +
		'ומביטה על הזקן כאילו מזמינה אותו ' +
		'אליה. ' +
		'הזקן ניגש קרוב יותר, והציפור ' +
		'התרוממה מהענף ועפה הלאה. וכל ' +
		'הזמן שרה, מזמרת. ' +
		'הזקן הלך אחריה לתוך הסבך  ' +
		'הגדול. והציפור עפה משם, ולא ' +
		'ראה אותה יותר. ' +
		'הזקן הקשיב - אולי היא שרה עוד ' +
		'איפה שהוא. אך לא. שקט סביב ורק ' +
		'לא רחוק פלג מים זורם. הזקן ' +
		'הסתכל היטב וראה שמתחת לאבן ' +
		'מעין בוקע, והמים בו כמו דמעה, ' +
		'שקופים, נקיים. ' +
		'הוא ניגש למעין ורצה לשתות את ' +
		'המים. לקח לגימה אחת והרגיש כוח ' +
		'גדל בגופו. רגליו הזקנות הפסיקו ' +
		'לרעוד, בוורידים התחיל לזרום דם ' +
		'חם. ' +
		'"איזה פלא!" חשב הזקן. הוא הרים ' +
		'יד כדי למשוך בזקן שלו - אולי הוא ' +
		'רק חלום חולם - אבל זקן איננו, ' +
		'כאילו לא היה מעולם. ' +
		'שמח הזקן. כנראה מצא את מעין ' +
		'הנעורים שעליו סיפרו אגדות בכפר?  ' +
		'הוא לקח עוד לגימה והחריצים ' +
		'העמוקים שעל פניו נעלמו והוא הפך ' +
		'לאיש צעיר. ' +
		'הוא רץ מהר הביתה. רץ וכל הזמן ' +
		'משתדל לזכור את הדרך, כדי ' +
		'להביא את הזקנה שלו אל המעיין. ' +
		'והזקנה חיכתה, חיכתה לשובו ' +
		'ויצאה מולו "אולי הוא נחלש בדרך, ' +
		'צריך לעזור לו" חושבת. ' +
		'היא הולכת בדרך ומולה רץ בחור ' +
		'צעיר. היא נעצרה ושואלת "אולי ' +
		'ראית איש זקן עם עצי הסקה? הוא ' +
		'הלך בבוקר ועדיין לא חזר?" ' +
		'והצעיר רק צוחק "תסתכלי עלי ' +
		'היטב, זקנה! האם אינך מכירה את ' +
		'בעלך קים?" ' +
		'הזקנה נבהלה. הקול מוכר לה ' +
		'היטב. וקים סיפר לה כל מה שקרה ' +
		'לו, והוביל אותה אל מעיין הפלא. ' +
		'הזקנה לקחה שתי לגימות והפכה ' +
		'לאישה צעירה יפהפה. הצעיר לקח ' +
		'את ידה של הצעירה והם חזרו ' +
		'שמחים הביתה. ' +
		'הגיעו ביתה ושם ליד הדלת עומד ' +
		'שכן. ' +
		'"ערב טוב, שכן" אומר קים. ' +
		'והשכן לא מכיר אותו. ' +
		'סיפר לו קים כל מה שקרה לו ולשכן ' +
		'הבריקו עיניים "אמור מהר, איפה ' +
		'המעיין בוקע?" ' +
		'קים הסביר לו איך להגיע למעין ' +
		'והשכן רץ מהר הביתה, לבש בגד ' +
		'חדש, חבש כובע גדול ורץ להרים. ' +
		'הוא הגיע למקום שעליו סיפר קים ' +
		'וראה - אמנם מים זורמים ממעין. ' +
		'ירד השכן על ברכיים, שתה לגימה ' +
		'אחת, שתה שניה, והפך לאיש ' +
		'צעיר. ' +
		'ואז חשב "אני רוצה להיות צעיר ' +
		'יותר מאשר קים". הוא לקח עוד ' +
		'לגימה ונעשה לילד. ניגב את שפתיו ' +
		'והוסיף "המים טעימים מאוד. ' +
		'אשתה עוד לגימה!" כך חשב ' +
		'והמשיך לשתות מים.. ' +
		'בערב הלך קים אל השכן ולא מצא ' +
		'אותו בבית. קים נבהל. אולי קרה לו ' +
		'דבר מה? והלך אל המעיין. ' +
		'הגיע ורואה - על הארץ מונח בגד ' +
		'חדש וכובע גדול, והשכן איננו. קים ' +
		'ניגש קרוב יותר, הרים את הכובע.. ' +
		'איזה פלא? תחת הכובע שוכב ' +
		'תינוק וישן חזק. ' +
		'נענע קים בראשו ' +
		'"כמה שאתה טיפש, שכני! האם ' +
		'אפשר לשתות כל כך הרבה מי ' +
		'פלא?" ' +
		'הוא עטף את הילד בבגד שהיה ' +
		'זרוק על האדמה והביא הביתה. ' +
		'שמחה האישה כשראתה את הילד. ' +
		'היא כבר מזמן השתוקקה לבן. ' +
		'וכך הם המשיכו לחיות בשלושה, ' +
		'והילד גדל והיה לאדם טוב וחרוץ. ' +
		'איוון בן האיכר ' +
		'במדינה אחת, בכפר אחד, חיו הורים זקנים, איכרים ' +
		'שעבדו את אדמתם. היו להם שלושה בנים. אינני יודע ' +
		'את שמות שני הגדולים, אך לצעיר קראו איוון. ' +
		'פעם התפרסם במדינה שמעבר לנהל סמורודינה ' +
		'התנחל פלא-מפלץ איום, שמתנפל על בני-אדם והורג ' +
		'אותם. ' +
		'ההורים הזקנים דאגו מאוד כששמעו זאת, והבנים ' +
		' נלך להלחם עם פלא-מפלץ האיום הזה, נכניע ' +
		'החליטו – ' +
		'אותו או נמות עצמנו. ' +
		'בעצב רב נפרדו ההורים מבניהם, והבנים לקחו את ' +
		'החרבות הדמשקאיות שלהם, תרמילים עם לחם ומלח, ' +
		'עלו על סוסיהם הטובים ונסעו. ' +
		'הם רכבו ורכבו עד שהגיעו לכפר כלשהו. מביטים - ' +
		'סביב אין נפש חיה ורק בית קטן אחד עומד שלם. נכנסו ' +
		'האחים לבית הזה, ושם אישה זקנה יושבת על תנור ' +
		'ושואלת: ' +
		'"צעירים טובים, לאן דרככם?" ' +
		'"אנו, סבתא, נוסעים לנהר סמורודינה, שעובר עליו גשר ' +
		'עץ אשור חזק. שם אנו רוצים להתמודד עם פלא-מפלץ ' +
		'האיום, למנוע ממנו להגיע אל האדמות שלנו.  ' +
		'"אכן מעשה טוב לקחתם על עצמכם, צעירים." ' +
		'האישה הזקנה הלינה את האחים ובבוקר נתנה להם ' +
		'ברכת דרך. ' +
		'רכבו שוב האחים עד שהגיעו לגשר עץ האשור שעל ' +
		'נהר סמורודינה. על חוף הנהר ראו פזורות שם חרבות ' +
		'וקשתות שבורות, וגם עצמות בני-אדם. ' +
		'לא רחוק עמד בית קטן, ריק, והם החליטו ללון בו. ' +
		'"הנה, אחים" אמר איוון "הגענו למטרה שלנו. אבל ' +
		'אנחנו במקום זר וצריך להקשיב היטב ולצפות היטב ' +
		'סביב. הבה ונעשה זאת במשמרות ונשמור שאף אחד ' +
		'לא יעבור את גשר עץ האשור שעל הנהר." ' +
		'בלילה הראשון שמר האח הבכור. הוא עבר לאורך ' +
		'החוף, הביט על נהר סמורודינה, ראה שהכל שקט, לא ' +
		'רואים נפש. הוא נשכב תחת שיח ונרדם. ' +
		'ואיוון בינתיים לא יכול היה לישון. לקראת חצות הוא קם, ' +
		'לקח את חרבו הדמשקאית ויצא לחוף הנהר. רואה - ' +
		'אחיו ישן תחת השיח.  ' +
		'איוון לא העיר אותו אלא ירד בעצמו תחת לגשר עץ ' +
		'האשור. ' +
		'עבר זמן ופתאום המים בנהר סערו, עיט שעל עץ גבוה ' +
		'זעק, הופיע פלא-מפלץ איום בעל ששה ראשים. הוא ' +
		'עלה על גשר עץ האשור רוכב על סוס אש, העורב יושב ' +
		'על כתפו, ומאחוריו רועש יער שחור. ' +
		'ופלא-מפלץ האיום אומר "שמעתי שאיוון בן האיכר בא ' +
		'להתמודד אתי. איפה הוא? אשים אותו על כף ידי אחת, ' +
		'אמחץ בשניה ונגמור את העניין!" ' +
		'ואז יצא איוון מתחת הגש ואומר: ' +
		'"אל לך להתרברב הזד. הבה ונשווה את כוחותינו!" ' +
		'והם התחילו בהתמודדות עד שהאדמה רעדה ' +
		'תחתיהם. במכה אחת של החרב הוריד איוון בן האיכר ' +
		'לפלא-מפלץ שלושה ראשים. ' +
		'צועק פלא-מפלץ: ' +
		'"תן לנוח!" ' +
		'ואיוון בן האיכר עונה: ' +
		'"לך עוד שלושה ראשים ולי רק אחד. כשיישאר אצלך ' +
		'רק ראש אחד אתן לך לנוח."  ' +
		'שוב התחילו להלחם ושוב בתנופת חרב אחד הוריד ' +
		'איוון בן האיכר שלושת הראשים נותרים של פלא-מפלץ. ' +
		'ואז הוא חתך את גופתו של המפלצת לחתיכות קטנות ' +
		'וזרק אותן לנהר. ואת ששת הראשים שם תחת גשר עץ ' +
		'האשור. ' +
		'חזר איוון לבית הקטן ונשכב לישון. ' +
		'בבוקר חזר האח הבכור מהשמירה. ' +
		'"ראית משהו בלילה?" שואל אותו איוון. ' +
		'"אפילו זבוב לא עבר לידי, אפילו יתוש לא זמזם." ' +
		'למחרת הגיע תורו של האח השני לשמור. הוא יצא ' +
		'לחוף הנהר, הביט סביב ואחר כך נשכב בין שיחים ' +
		'ונרדם שם. ' +
		'איוון לא סמך עליו. לקראת חצות הלילה לקח את חרבו ' +
		'החדה ויצא אל הנהר סמורודינה. שם ירד תחת גשר עץ ' +
		'האשור והתחיל לשמור. ' +
		'ושוב סערו מי הנהר ויצא מהמים ופלא-מפלץ איום בן ' +
		'תשעה ראשים. איוון בן האיכר בא מולו כדי להתמודד ' +
		'בו.  ' +
		'הניף איוון את חרבו הדמשקאית והוריד ששה ראשים ' +
		'של פלא-מפלץ. ופלא-מפלץ הכה לאיוון מלמעלה עד ' +
		'שהוא שקע באדמה עד הברכיים. ' +
		'לקח איוון חופן חול וזרק בעיני האויב. עד שפלא-מפלץ ' +
		'ניגב את החול מעיניו איוון בן האיכר הוריד לו את ' +
		'שלושת הראשים הנותרים. ' +
		'שוב הוא חתך את גופתו של המפלץ לחתיכות, ותשעה ' +
		'הראשים שם תחת גשר עץ האשור. ואז חזר לבית ' +
		'הקטן, נשכב ונרדם. ' +
		' בבוקר בא האח שיצא לשמור ' +
		'"ראית משהו בלילה?" שואל אותו איוון. ' +
		'"אפילו זבוב לא עבר לידי, אפילו יתוש לא זמזם." ' +
		'"אז בואו אחיי אתי. אראה לכם זבוב ויתוש." ' +
		'הוביל אותם איוון תחת גשר עץ האשור והראה להם את ' +
		'ראשי פלא-מפלץ. האחים התביישו מאוד. ' +
		'בלילה שלישי היה תורו של איוון לשמור. ' +
		'הוא אמר לאחים: ' +
		'"אני יוצא עכשיו לקרב איום, ואתם, כשרק תשמעו את ' +
		'קריאתי, שחררו את הסוס שלי ובואו לעזרה."  ' +
		'יצא איוון בן האיכר אל נהר סמורודינה. ובחצות הלילה ' +
		'יצא על גשר עץ האשור פלא-מפלץ בעל שתים-עשר ' +
		'ראשים רוכב על סוסו. כל שתים-עשר הראשים שורקים ' +
		'קול מחריש אוזניים ויורקים אש. לסוסו של פלא-מפלץ ' +
		'שתים-עשרה כנפיים, פרוותו מנחושת, זנב ורעמה ' +
		'מברזל. ' +
		'איוון בן האיכר יצא מולו מתחת לגשר עץ. ' +
		'"מה איתך איוון? לשם מה באת?" שאל פלא-מפלץ. ' +
		'"אלחם בך, יצור מקולל, כדי שלא תמשיך להרוג אנשים ' +
		'טובים!" עונה לו איוון בן האיכר. ' +
		'הוא הניף את חרבו החדה והוריד למפלץ שלושה ' +
		'ראשים. אבל פלא-מפלץ תפס אותם, נגע בהם באצבע ' +
		'לוהטת שלו, הניח על הצוואר והם נדבקו בחזרה. ' +
		'רע היה לאיוון. פלא-מפלץ מחריש אותו בשריקה, יורק ' +
		'עליו אש, מכה בו עד שאיוון שוקע עד הברכיים באדמה. ' +
		'איוון בן האיכר אגר כוחות ושוב הוריד למפלץ ששה ' +
		'ראשים. פלא-מפלץ תפס את הראשים, נגע בהם ' +
		'באצבע לוהטת שלו, שם לצוואר והם שוב נדבקו.  ' +
		'ועכשיו נתן לו פלא-מפלץ מכה כזו שאיוון שקע באדמה ' +
		'עד החגורה. אבל הוא הניף את החרב בשלישית והוריד ' +
		'לפלא-מפלץ תשעה ראשים. פלא-מפלץ תפס אותם, נגע ' +
		'בהם באצבע לוהטת, שם על הצוואר והם שוב נדבקו. ' +
		'ןאז התנפל על איוון ובמכה השקיע אותו באדמה עד ' +
		'הכתפיים. ' +
		'איוון הוריד את כובעו וזרק אותו אל הבית. רק אז ' +
		'התעוררו האחים, פתחו אורווה, שחררו את הסוס של ' +
		'איוון ובעצמם רכבו אחרי הסוס לאיוון לעזרה. ' +
		'הסוס של איוון התחיל לבעוט בפלא-מפלץ בפרסות ' +
		'שלו, ואיוון יצא מהאדמה, כוון היטב וחתך לפלא-מפלץ ' +
		'את האצבע הלוהטת ומיד המשיך לחתוך את הראשים. ' +
		'הוריד את כולם, את הגוף חתך לחתיכות קטנות, פירר ' +
		'אותם וזרק פירורים לתוך הנהר סמורודינה. ' +
		'ינתיים הגיעו האחים, לקחו את איוון לבית, רחצו אותו, ' +
		'ב ' +
		'האכילו, השקו והשכיבו לישון. ' +
		'בבוקר מוקדם קם איוון ויצא אל הבית האבן של ' +
		'פלא-מפלץ. ישבו שם שלוש פלא-מפלצות, נשים של ' +
		'המפלץ וגם האם, מפלצת-דרקון זקנה.  ' +
		'הן דיברו ביניהן איך לנקום את מותו של פלא-מפלץ. ' +
		'הקשיב להם בהסתר איוון בן האיכר וחזר אל אחיו. ' +
		'התחילו האחים לחזור הביתה. נסעו בשדות, בעמקים. ' +
		'יום היה חם ומעייף, רצו מאוד לשתות. והנה במקום ' +
		'אחד ראו באר. אמרו לאיוון: ' +
		'"נעצור כאן ונשתה מים קרים, ננוח." ' +
		'איוון קפץ מהסוס ובחרב הכה בדפנות הבאר. התחילה ' +
		'הבאר לילל, לשאוג. התפורר ולא היה יותר. ומיד בא ' +
		'ענן, החום פסק וכבר לא רצו יותר לשתות. ' +
		'נסעו האחים הלאה. נסעו זמן רב וראו עץ תפוח. ירדו ' +
		'האחים מהסוסים כדי לקטוף תפוחים. אבל איוון התחיל ' +
		'לחתוך את העץ סמוך לשורשים. התחיל העץ לילל, ' +
		'לשאוג.. נפל על נארץ ומת. ' +
		'עלו האחים שוב על הסוסים והמשיכו בדרך. ' +
		'רכבו זמן רב והתעייפו מאוד. והנה רואים על העשב ' +
		'מונח שטיח רקום. רצו האחים לשכב על השטיח כדי ' +
		'לנוח. ואיוון לא אמר להם מילה אלא הוריד את ' +
		'האבנט שלו וזרק על השטיח. האבנט נדלק, בער ' +
		'בלהבה גדולה ונשרף. לא נשאר ממנו דבר.  ' +
		'אזי ניגש איוון אל השטיח, חתך אותו לחתיכות ואמר ' +
		'לאחים: ' +
		'"הבאר, עץ התפוח, השטיח, אלה היו נשים של ' +
		'פלא-מפלץ. הן רצו להרוג אותנו אבל לא הצליחו ונהרגו ' +
		'בעצמן!" ' +
		'נסעו האחים הלאה. ' +
		'פתאום השמיים חשכו, רוח יללה, אדמה רעדה. עפה ' +
		'מפלצת-דרקון, אם של פלא-מפלץ בעצמה. פתחה את ' +
		'הלוע שלה מהשמיים ועד הארץ, רוצה לבלוע את איוון ' +
		'יחד עם אחיו. ' +
		'ראה איוון שזו צרה גדולה. הכה בסוסו והתחיל לדהור, ' +
		'והאחים אחריו. דוהרים ורואים - לפניהם נפחיה ונפחים ' +
		'עובדים בה. ' +
		'הנפחים הכניסו את איוון והאחים וסגרו אחריהם תריסר ' +
		'דלתות ברזל ונעלו בתריסר מנעולים מחושלים. ' +
		'באה מפלצת-דרקון לנפחיה וצועקת: ' +
		'"נפחים, תנו לי את איוון ואת אחיו!"  ' +
		'והנפחים אומרים: ' +
		'"תלקקי בלשון הלוהטת שלך תריסר דלתות ברזל ' +
		'ותריסר מנעולים מחושלים ואז תקחי אותם!" ' +
		'התחילה מפלצת-דרקון ללקק את דלתות הברזל. ' +
		'ליקקה, ליקקה, ליקקה אחת-עשרה דלתות, נשארה ' +
		'הדלת האחרונה. ' +
		'התעייפה מפלצת-דרקון ולפני הדלת האחרונה ישבה ' +
		'לנוח. ואז איוון בן האיכר קפץ מהנפחיה, תפס את ' +
		'המפלצת ובתנופה דפק בה באבן. התפוררה המפלצת ' +
		'הזקנה לחתיכות קטנות והרוח פיזרה אותן לכל ' +
		'הכיוונים. ' +
		'מאז נעלמו כל המפלצות בארץ זו והאנשים יכלו לחיות ' +
		'בבטחון ובשלום. ' +
		'ואיוון בן האיכר חזר הביתה יחד עם האחים, לאבא ' +
		'ולאמא. והם המשיכו לחיות כמו קודם, כמו קודם חרשו ' +
		'שדות, זרעו שיפון וחיטה. ';
}
